Repository: ebrancati/OnlineCheckers.org
Catalog: frontend/src/locale/messages.*.xlf
Languages: it

# BOT.YOUR_TURN_ERROR
source: It's your turn!
it: È il tuo turno!

# BOT.BOT_TURN_ERROR
source: It's the bot's turn! Please wait for its move...
it: È il turno del bot! Attendere la sua mossa...

# GAME_OVER.TITLE
source: Game Over!
it: Partita Terminata!

# BOT.YOU_WON
source: You won the game!
it: Hai vinto la partita!

# BOT.BOT_WON
source: The bot won the game!
it: Il bot ha vinto la partita!

# GAME_OVER.NEW_GAME
source: New Game
it: Nuova Partita

# BOT.CAPTURING
source: Capturing...
it: Catturando...

# BOT.THINKING
source: Bot is thinking...
it: Il bot sta pensando...

source: Bot Options
it: Opzioni Bot

# BOT.DIFFICULTY
source: Difficulty Level
it: Livello di Difficoltà

# BOT.EASY
source: Easy
it: Facile

# BOT.MEDIUM
source: Medium
it: Medio

# BOT.HARD
source: Hard
it: Difficile

# BOT.NEW_GAME
source: New Game
it: Nuova Partita

# CHAT.PLACEHOLDER
source: Write a message...
it: Scrivi un messaggio...

# FOOTER.TAGLINE
source: Play checkers online with friends or against the computer
it: Gioca a dama online con amici o contro il computer

# FOOTER.PRIVACY_POLICY
source: <i class="bi bi-shield-check me-1"></i> Privacy Policy
it: Informativa sulla Privacy

# FOOTER.OUR_TEAM
source: Contacts
it: Contatti

# FOOTER.JOIN_COMMUNITY
source: Join Community
it: Unisciti alla Community

# INFO_MODAL.OFFLINE_MODE_TITLE
source: <i class="bi bi-house me-3"></i> Local Game
it: Gioco Locale

# COMMON.PLAY
source: <i class="bi bi-rocket"></i> Play
it: Gioca

# COMMON.RULES
source: <i class="bi bi-book"></i> Rules
it: Regole

# COMMON.THEME
source: <i class="bi" [ngClass]="isDarkTheme ? 'bi-sun' : 'bi-moon'"></i><span class="theme-toggle-text">Change Theme</span>
it: Cambia Tema

# GAME.WHITE_TURN_ERROR
source: It's Player White's turn!
it: È il turno del Giocatore Bianco!

# GAME.BLACK_TURN_ERROR
source: It's Player Black's turn!
it: È il turno del Giocatore Nero!

# GAME_OVER.WINNER
source: The winner is
it: Ha vinto il giocatore

# GAME.WHITE_PLAYER
source: White Player
it: Giocatore Bianco

# GAME.BLACK_PLAYER
source: Black Player
it: Giocatore Nero

# GAME.TURN
source: Turn
it: Turno

# GAME_OVER.WHITE
source: White
it: Bianco

# GAME_OVER.BLACK
source: Black
it: Nero

# GAME.RECENT_MOVES
source: Recent Moves
it: Mosse Recenti

# SPECTATOR.VIEWING_MODE
source: Spectator Mode
it: Modalità Spettatore

# SPECTATOR.DEFAULT_MESSAGE
source: You are viewing this game as a spectator. You cannot make moves or chat.
it: Stai visualizzando questa partita come spettatore. Non puoi effettuare mosse o inviare messaggi.

# WEBSOCKET.CONNECTED
source: 🟢 Connected
it: Connesso

# WEBSOCKET.CONNECTING
source: 🟡 Connecting...
it: Connessione...

# WEBSOCKET.DISCONNECTED
source: 🔴 Disconnected
it: Disconnesso

# WEBSOCKET.RECONNECT
source: <i class="bi bi-arrow-clockwise me-1"></i> Reconnect
it: Riconnetti

# COMMON.SHARE_GAME
source: <i class="bi bi-share-fill me-2"></i> Share this game
it: Condividi questa partita

# COMMON.SHARE_LINK
source: Share this link with your opponent:
it: Condividi questo link con il tuo avversario:

# COMMON.COPY
source: <i class="bi bi-clipboard"></i> Copy
it: Copia

# COMMON.COPY_SUCCESS
source: Link copied to clipboard!
it: Link copiato negli appunti!

# SPECTATOR.WATCHING
source: spectators watching
it: spettatori stanno guardando

# GAME.PIECES
source: Pieces
it: Pedine

# GAME.WAITING_STATUS
source: Waiting
it: Attesa

# GAME.WAITING
source: Waiting...
it: In attesa...

# JOIN.WAITING_FOR_OPPONENT
source: The game will start when another player joins.
it: La partita inizierà quando un altro giocatore si unirà.

# GAME.CONNECTING
source: Connecting
it: Connessione in corso

# GAME.ROLE_DETERMINING
source: Determining role in the game...
it: Determinazione del ruolo nella partita...

# GAME.CURRENT_TURN
source: Current Turn
it: Turno Corrente

# GAME_OVER.RESTART_REQUESTED
source: Rematch request sent!
it: Richiesta di rivincita inviata!

# GAME_OVER.WAITING_FOR_OPPONENT_RESTART
source: Waiting for opponent to accept rematch...
it: In attesa che l'avversario accetti la rivincita...

# GAME_OVER.OPPONENT_WANTS_RESTART
source: Opponent has requested a rematch!
it: L'avversario ha richiesto una rivincita!

# GAME_OVER.REQUEST_REMATCH
source: Request Rematch
it: Richiedi Rivincita

# GAME_OVER.CANCEL_REQUEST
source: Cancel Request
it: Annulla Richiesta

# GAME_OVER.BACK_TO_MENU
source: Back to Menu
it: Torna al Menu

# RULES.TITLE
source: English Checkers - Rules and How to Play
it: Dama Inglese - Regole e Come Giocare

# RULES.INTRODUCTION
source: English Checkers is a traditional board game played on an 8x8 board with 12 pieces per player. It is one of the most widely played variants of checkers around the world.
it: La Dama Inglese è un gioco da tavolo tradizionale giocato su una scacchiera 8x8 con 12 pedine per giocatore. È una delle varianti di dama più diffuse al mondo.

# RULES.HISTORY_TITLE
source: <i class="bi bi-book me-2"></i> History of English Checkers
it: Storia della Dama Inglese

# RULES.HISTORY_TEXT_1
source: English Checkers has a long history dating back to medieval times in England and other parts of Europe.
it: La Dama Inglese ha una lunga storia che risale al periodo medievale in Inghilterra e in altre parti d'Europa.

# RULES.HISTORY_TEXT_2
source: The first book on the game was published in 1756 by William Payne, titled 'An Introduction to the Game of Draughts'.
it: Il primo libro sul gioco fu pubblicato nel 1756 da William Payne, intitolato 'An Introduction to the Game of Draughts'.

# RULES.HISTORY_TEXT_3
source: The game's popularity spread throughout the British Empire and became particularly established in the United States, where it is commonly known as 'Checkers'.
it: La popolarità del gioco si diffuse in tutto l'Impero Britannico e si stabilì particolarmente negli Stati Uniti, dove è comunemente conosciuto come 'Checkers'.

# RULES.HISTORY_TEXT_4
source: In 1847, the first world championship of checkers was held, establishing the game as a serious competitive pursuit.
it: Nel 1847 si tenne il primo campionato mondiale di dama, stabilendo il gioco come un'attività competitiva seria.

# RULES.BOARD_TITLE
source: <i class="bi bi-grid-3x3 me-2"></i> The Board
it: La Scacchiera

# RULES.BOARD_TEXT_1
source: English Checkers is played on a standard 8x8 chessboard with 64 squares, using only the 32 dark squares.
it: La Dama Inglese si gioca su una scacchiera standard 8x8 con 64 caselle, utilizzando solo le 32 caselle scure.

# RULES.BOARD_TEXT_2
source: Each player begins with 12 pieces placed on the dark squares of the first three rows closest to them.
it: Ogni giocatore inizia con 12 pedine posizionate sulle caselle scure delle prime tre file più vicine a loro.

# RULES.MOVEMENT_TITLE
source: <i class="bi bi-arrow-left-right me-2"></i> Movement and Capture
it: Movimento e Cattura

# RULES.MOVEMENT_TEXT_1
source: Pieces move diagonally forward one square at a time. They cannot move backward until they become kings.
it: Le pedine si muovono in diagonale avanti di una casella alla volta. Non possono muoversi all'indietro fino a quando non diventano dame.

# RULES.MOVEMENT_TEXT_2
source: Capture occurs by jumping over an opponent's piece to an empty square directly beyond. The jumped piece is removed from the board.
it: La cattura avviene saltando sopra una pedina avversaria verso una casella vuota direttamente oltre. La pedina saltata viene rimossa dalla scacchiera.

# RULES.MOVEMENT_TEXT_3
source: If after a capture it is possible to make further captures, the player must continue the sequence with the same piece until no further captures are possible (multiple jumps).
it: Se dopo una cattura è possibile effettuarne altre, il giocatore deve continuare la sequenza con la stessa pedina fino a quando non sono più possibili ulteriori catture (salti multipli).

# RULES.MOVEMENT_TEXT_4
source: If a player has the opportunity to capture, they must do so. If multiple capture sequences are available, the player may choose any valid capture sequence, regardless of how many pieces are captured.
it: Se un giocatore ha l'opportunità di catturare, deve farlo. Se sono disponibili più sequenze di cattura, il giocatore può scegliere qualsiasi sequenza valida, indipendentemente da quante pedine vengono catturate.

# RULES.KINGS_TITLE
source: <i class="bi bi-trophy me-2"></i> The Kings
it: Le Dame

# RULES.KINGS_TEXT_1
source: A piece becomes a king when it reaches the last row on the opponent's side of the board. It is usually crowned by placing a second piece on top of it.
it: Una pedina diventa dama quando raggiunge l'ultima fila sul lato avversario della scacchiera. Di solito viene incoronata posizionando una seconda pedina sopra di essa.

# RULES.KINGS_TEXT_2
source: A king can move diagonally both forward and backward, but still moves only one square at a time except when capturing.
it: Una dama può muoversi in diagonale sia avanti che indietro, ma si muove comunque di una sola casella alla volta tranne quando cattura.

# RULES.KINGS_TEXT_3
source: Kings capture in the same way as regular pieces, but can do so in all four diagonal directions. Like regular pieces, kings must make all available captures. Kings can be captured by regular pieces following the same capture rules.
it: Le dame catturano nello stesso modo delle pedine normali, ma possono farlo in tutte e quattro le direzioni diagonali. Come le pedine normali, le dame devono effettuare tutte le catture disponibili. Le dame possono essere catturate dalle pedine normali seguendo le stesse regole di cattura.

# JOIN.JOIN_GAME
source: Join Game
it: Partecipa alla Partita

# ERRORS.GAME_NOT_FOUND
source: The game you're trying to join doesn't exist.
it: La partita che stai cercando di unire non esiste.

# ERRORS.GAME_FULL
source: This game already has two players and cannot accept more participants.
it: Questa partita ha già due giocatori e non può accettare altri partecipanti.

# ERRORS.SELF_PLAY_NOT_ALLOWED
source: You cannot play against yourself in online mode. Please use the 'Play Locally' option from the main menu.
it: Non puoi giocare contro te stesso nella modalità online. Utilizza l'opzione 'Gioca in Locale' dal menu principale.

# ERRORS.SERVER_ERROR
source: An error occurred while connecting to the server. Please try again later.
it: Si è verificato un errore durante la connessione al server. Riprova più tardi.

# ERRORS.JOIN_FAILED
source: Failed to join the game. Please try again.
it: Impossibile unirsi alla partita. Riprova.

# ERRORS.UNKNOWN_ERROR
source: An unknown error occurred. Please try again later.
it: Si è verificato un errore sconosciuto. Riprova più tardi.

# ERRORS.CREATE_NEW_GAME
source: Create New Game
it: Crea Nuova Partita

# JOIN.NICKNAME
source: Your nickname
it: Il tuo nickname

# JOIN.NEXT
source: Next
it: Avanti

# JOIN.GAME_ID
source: Game ID
it: ID Partita

# JOIN.JOIN_AS
source: Join as
it: Unisciti come

# NICKNAME_VALIDATION.EMPTY_NICKNAME
source: Nickname cannot be empty
it: Il nickname non può essere vuoto

# NICKNAME_VALIDATION.TOO_SHORT
source: Nickname must be at least 3 characters
it: Il nickname deve avere almeno 3 caratteri

# NICKNAME_VALIDATION.TOO_LONG
source: Nickname cannot exceed 20 characters
it: Il nickname non può superare i 20 caratteri

# NICKNAME_VALIDATION.INVALID_CONTENT
source: This nickname is not allowed
it: Questo nickname non è consentito

# NICKNAME_VALIDATION.UNKNOWN
source: Invalid nickname. Please try another one
it: Nome utente non valido. Prova ad inserirne un altro

# LOGIN.YOUR_NICKNAME
source: Your Nickname:
it: Il tuo Nickname:

# LOGIN.ENTER_NICKNAME
source: Enter your nickname
it: Inserisci il tuo nickname

# LOGIN.CHOOSE_TEAM
source: Choose your team
it: Scegli il tuo team

# LOGIN.PLAY
source: Play
it: Gioca

# MENU.SELECT_MODE
source: Select Game Mode
it: Seleziona Modalità di Gioco

# MENU.ONLINE
source: Play Online <i class="bi bi-globe me-2"></i>
it: Gioca Online

# MENU.VS_COMPUTER
source: Play against Computer <i class="bi bi-robot me-2"></i>
it: Gioca contro il Computer

# MENU.LOCAL
source: Play Locally <i class="bi bi-wifi-off me-2"></i>
it: Gioca in Locale
